app/controllers/consumers_controller.rb

  def index

    params[:search].capitalize! if params[:search]

    @consumers = Consumer.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"], :order => 'name')
---
SELECT * FROM "consumers" WHERE (name LIKE '%%') ORDER BY name

  def show
    @consumer = Consumer.find(params[:id])
---
SELECT * FROM "consumers" WHERE ("consumers"."id" = 1)

  def edit
    @consumer = Consumer.find(params[:id])
---
SELECT * FROM "consumers" WHERE ("consumers"."id" = 2)

  def create
    @consumer = Consumer.new(params[:consumer])
    @consumer.name.capitalize!
    @consumer.city.capitalize!
    @consumer.state.capitalize!

    respond_to do |format|
      if @consumer.save
---
INSERT INTO "consumers" ("name", "address", "city", "pin", "state", "country", "phone", "mobile", "email", "website", "note", "created_at", "updated_at") VALUES('Naveen', '22/9 Rajeev Nagar', 'Hosur', 635109, 'Tamilnadu', 'India', '09940745400', '', '', '', '', '2010-05-27 07:01:00.000000', '2010-05-27 07:01:00.000000') RETURNING "id"

  def update
    @consumer = Consumer.find(params[:id])

    respond_to do |format|
      if @consumer.update_attributes(params[:consumer])
---
SELECT * FROM "consumers" WHERE ("consumers"."id" = 2)
UPDATE "consumers" SET "address" = 'Alien Street', "city" = 'Mars', "pin" = 900, "state" = 'Silicon Crater', "country" = 'Microship', "phone" = '000', "mobile" = '000000100', "email" = 'BLAHBLAH@reddit.com', "website" = 'http://reddit.com', "note" = 'hmmmmm.........', "created_at" = '2010-05-27 07:05:00.000000', "updated_at" = '2010-05-27 07:37:17.475805' WHERE "id" = 2

  def destroy
    @consumer = Consumer.find(params[:id])
    @consumer.destroy
---
SELECT * FROM "consumers" WHERE ("consumers"."id" = 1)
DELETE FROM "consumers" WHERE "id" = 1