app/controllers/products_controller.rb

  def create
    @consumer = Consumer.find(params[:consumer_id])
    @product = @consumer.products.create!(params[:product])
---
SELECT * FROM "consumers" WHERE ("consumers"."id" = 2)
INSERT INTO "products" ("product", "slno", "model", "capacity", "datepurchased", "warranty", "remark", "consumer_id", "created_at", "updated_at") VALUES('UPS', '', '', '', NULL, NULL, '', NULL, '2010-05-27 17:44:55.092375', '2010-05-27 17:44:55.092375') RETURNING "id"

  def destroy
     @consumer = Consumer.find(params[:consumer_id])
     @product = Product.find(params[:id])
     @product.destroy
---
SELECT * FROM "consumers" WHERE ("consumers"."id" = 1)
SELECT * FROM "products" WHERE ("products"."id" = 1)
DELETE FROM "products" WHERE "id" = 1

  def update
    @consumer = Consumer.find(params[:consumer_id])
    @product = Product.find(params[:id])
---
SELECT * FROM "consumers" WHERE ("consumers"."id" = 1)
SELECT * FROM "products" WHERE ("products"."id" = 16)